Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense (Dense)                (None, 2000, 64)          524352
_________________________________________________________________
dropout (Dropout)            (None, 2000, 64)          0
_________________________________________________________________
dense_1 (Dense)              (None, 2000, 64)          4160
_________________________________________________________________
dense_2 (Dense)              (None, 2000, 1)           65
=================================================================
Total params: 528,577
Trainable params: 528,577
Non-trainable params: 0
_________________________________________________________________
